Revit 2027 API
LinearArray.IsValidNumberOfMembers Method
 This indicates whether the input count is a valid size for an array based on the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidNumberOfMembers(
	int count,
	Document pADoc
)
Public Shared Function IsValidNumberOfMembers (
	count As Integer,
	pADoc As Document
) As Boolean
public:
static bool IsValidNumberOfMembers(
	int count,
	Document^ pADoc
)
static member IsValidNumberOfMembers :
        count : int *
        pADoc : Document -> bool
Parameters
count Int32
 The count.
pADoc Document
 The document.
Return Value
Boolean
 True if an array can be set to the specified count in the given document, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 In project documents, the array count must be between 2 and 200. In family documents, the array count must be between 0 and 200.
See Also
Reference
LinearArray Class
Autodesk.Revit.DB Namespace